In [1]:
# Importing pandas and numpy Libraries
import pandas as pd
import numpy as np
# outer, right, left and join operation.

In [2]:
# Defing Dataframe First_cols
First_cols = pd.DataFrame({'Com1': ['A', 'B', 'C'],'Com2': ['P', 'Q', 'R'], 'Num1': [111, 222, 333]})
First_cols

  Com1 Com2  Num1
0    A    P   111
1    B    Q   222
2    C    R   333

In [3]:
# Defing Dataframe Second_cols
Second_cols = pd.DataFrame({'Com1':  ['A', 'B', 'C'],'Com2': ['P', 'T', 'R'], 'Num2': [444, 555, 666]}) 
Second_cols

  Com1 Com2  Num2
0    A    P   444
1    B    T   555
2    C    R   666

In [9]:
First_cols.merge(Second_cols, how = 'outer') # Main priority is First_cols
# Key is Com1 and Com2

  Com1 Com2   Num1   Num2
0    A    P  111.0  444.0
1    B    Q  222.0    NaN
2    C    R  333.0  666.0
3    B    T    NaN  555.0

In [11]:
First_cols.merge(Second_cols, how = 'right') # Right is Second_cols
# Key is Com1 and Com2

  Com1 Com2   Num1  Num2
0    A    P  111.0   444
1    C    R  333.0   666
2    B    T    NaN   555

In [12]:
First_cols.merge(Second_cols, how = 'left') # Left is First_cols
# Key is Com1 and Com2

  Com1 Com2  Num1   Num2
0    A    P   111  444.0
1    B    Q   222    NaN
2    C    R   333  666.0

In [13]:
First_cols

  Com1 Com2  Num1
0    A    P   111
1    B    Q   222
2    C    R   333

In [14]:
Second_cols

  Com1 Com2  Num2
0    A    P   444
1    B    T   555
2    C    R   666

In [19]:
First_cols.join(Second_cols, lsuffix='_First', rsuffix='_Second') # join operation

  Com1_First Com2_First  Num1 Com1_Second Com2_Second  Num2
0          A          P   111           A           P   444
1          B          Q   222           B           T   555
2          C          R   333           C           R   666

In [20]:
First_cols.join(Second_cols, lsuffix='_First', rsuffix='_Second', how='inner') # Inner join operation

  Com1_First Com2_First  Num1 Com1_Second Com2_Second  Num2
0          A          P   111           A           P   444
1          B          Q   222           B           T   555
2          C          R   333           C           R   666